app/admin/dashboard.rb

       column do
         panel "Recent Notes" do
           ul do
             Note.order(created_at: :desc).first(5).map do |note|
---
SELECT "notes".* FROM "notes" ORDER BY "notes"."created_at" DESC LIMIT ?  [["LIMIT", 5]]

       column do
        panel "Recent Subjects" do
          ul do
            Subject.order(created_at: :desc).first(5).map do |subject|
---
SELECT "subjects".* FROM "subjects" ORDER BY "subjects"."created_at" DESC LIMIT ?  [["LIMIT", 5]]