app/admin/subjects.rb

   permit_params :name, note_id: []

show title: "Subject" do
    h3 'You have ' + pluralize(subject.note.count, 'note') + ' for this subject'
    subject.note.map do |note|
---
SELECT COUNT(*) FROM "notes" WHERE "notes"."subject_id" = ?  [["subject_id", 2]]
SELECT "notes".* FROM "notes" WHERE "notes"."subject_id" = ?  [["subject_id", 2]]